TesboCFD/modules/OpenQBMM/tutorials/mixingTransportFoam/twoStreamsQMOM/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 0 -1 0 0 0 0 ];

internalField   nonuniform List<scalar> 
5870
(
1.2447747656e-09
1.32300964967e-09
1.59173762335e-09
2.2208215557e-09
1.54988345881e-09
2.60963857873e-09
1.35455939858e-09
2.76310847619e-09
...
)
;

boundaryField
{
    inlet1
    {
        type            calculated;
        value           nonuniform List<scalar> 
15
(
-2.5677844142e-09
-2.56778441419e-09
-2.56778441418e-09
-2.56778441417e-09
-2.56778441417e-09
-2.56778441417e-09
-2.56778441416e-09
-2.56778441416e-09
-2.56778441416e-09
-2.56778441416e-09
-2.56778441416e-09
-2.56778441416e-09
-2.56778441416e-09
-2.56778441416e-09
-2.56778441416e-09
)
;
    }
    inlet2
    {
        type            calculated;
        value           nonuniform List<scalar> 
15
(
-2.56778441416e-09
-2.56778441416e-09
-2.56778441416e-09
-2.56778441416e-09
-2.56778441416e-09
-2.56778441416e-09
-2.56778441416e-09
-2.56778441416e-09
-2.56778441416e-09
-2.56778441417e-09
-2.56778441417e-09
-2.56778441417e-09
-2.56778441418e-09
-2.56778441419e-09
-2.5677844142e-09
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
30
(
2.59004487539e-10
7.33773992605e-10
1.17595436089e-09
1.58507937668e-09
1.96080633421e-09
2.30287969916e-09
2.61110663351e-09
2.88534036609e-09
...
)
;
    }
    walls
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
        value           nonuniform 0;
    }
}


// ************************************************************************* //
