TesboCFD/modules/OpenQBMM/tutorials/mixingTransportFoam/twoStreamsQMOM/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "moment.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors    1;
    nNonOrthogonalCorrectors 0;
    nCorrectors         1;
    pRefCell            0;
    pRefValue           1.0e5;
}

relaxationFactors
{
    equations
    {
        "moment.*"      1;
    }
}
// ************************************************************************* //
